IDEA StatiCa Open Model
RebarSingle.Translation Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Returns the translation of the rebar geometry (RebarShape). It is an Insert point in reference line coordinate system
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public Vector3D Translation { get; set; }
Public Property Translation As Vector3D
	Get
	Set
public:
property Vector3D^ Translation {
	Vector3D^ get ();
	void set (Vector3D^ value);
}
Property Value
Type: Vector3D
See Also
Reference
RebarSingle Class
IdeaRS.OpenModel.Model Namespace